app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "art"], ["body", "new art"], ["created_at", "2020-09-02 12:23:51.532315"], ["updated_at", "2020-09-02 12:23:51.532315"]]
---
    def create
      @article = Article.new(article_params)
      @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "This is the text for my article, woo hoo!\r\nEdited"], ["updated_at", "2020-09-02 09:25:38.919280"], ["id", 1]]
---
    def update
      @article = Article.find(params[:id])
      @article.update(article_params)