app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "guy"], ["body", "cheap ones"], ["article_id", 10], ["created_at", "2020-09-02 12:24:26.647153"], ["updated_at", "2020-09-02 12:24:26.647153"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.article_id = params[:article_id]

    @comment.save